<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"9a09b09bb18c6546713d73c37a8c1a20e774e4b1e129d8c184ab224bf615af43","plan_job_ref":"Job Plan Airflow DAGs #455 at https://github.com/cal-itp/data-infra/actions/runs/16841898562","plan_out_hash":"91ca47291bd8d06738a0c554a4256727c578897aac32cc6b5194f599db685329","plan_hash":"b9a01080ae7ba96f2c4e3083b028e8c7a560fdb42e57fa8ad39b9ec15616ac99","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "HtdjPw==" -> (known after apply)
!~      detect_md5hash      = "ll3Ae5ptdEkEFslfVioimg==" -> "different hash"
!~      generation          = 1754429780606874 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "ll3Ae5ptdEkEFslfVioimg==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["macros/_macros.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/macros/_macros.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/macros/_macros.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "Wh9EjQ==" -> (known after apply)
!~      detect_md5hash      = "BFGc89boFKyIOGXmS1ei0w==" -> "different hash"
!~      generation          = 1754429782219940 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "BFGc89boFKyIOGXmS1ei0w==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #455](https://github.com/cal-itp/data-infra/actions/runs/16841898562)